hw2/report.org
#+TITLE: CSE312 - Operating Systems - HW#2

#+OPTIONS: num:nil
#+SETUPFILE: /home/near/opt/template-nodate.org
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{multicol}
#+LATEX_HEADER: \definecolor{bg}{rgb}{0.95,0.95,0.95}
#+LATEX_HEADER: \newminted{c}{fontsize=\footnotesize,frame=single,framesep=2mm}
#+LATEX_HEADER: \newminted{s}{fontsize=\footnotesize,frame=single,framesep=2mm}
#+LATEX_HEADER: \newminted{text}{fontsize=\footnotesize,frame=single,framesep=2mm}

# #+ATTR_LATEX: :font \ttfamily{}

* Design Explanation
  
  - In some cases =switch_thread()= needs to be triggered regardless of the timer interrupt. (Like join, mutex lock or thread exit system calls.) In these cases the program counter is incremented 2 times. To avoid this when =switch_thread= manually triggered, the program counter decrmeneted by 4 (=BYTES_PER_WORD=).

** Thread Table
   Thread tabel are going to keep track of: 
   - Thread ID
   - Program Counter
   - Registers
   - Stack
   - State
of each thread.

These data corresponds the struct defined in =syscall.h= in case of =spim=:

# TODO: update here
#+begin_export latex
\begin{ccode}
enum thread_state { READY=0, RUNNING, BLOCKED, TERMINATED };

typedef struct thread {
  int thread_id;
  reg_word R[R_LENGTH];
  reg_word HI, LO;
  mem_addr PC, nPC;
  double *FPR;
  float *FGR;
  int *FWR;
  reg_word CCR[4][32], CPR[4][32];
  mem_word *stack_seg;
  short *stack_seg_h;
  BYTE_TYPE *stack_seg_b;
  mem_addr stack_bot;
  thread_state state;
}thread;
\end{ccode}
#+end_export

  - In spim source code it indicates that =stack_seg= represents the stack segment and boundaries. =stack_seg_h= and =stack_seg_b= points to same vector as =stack_seg=. This data will be backed & restored.

The process table implemented as global =std::vector=. The first element of the vector is always going to be the main thread.

#+begin_export latex
\begin{ccode}
static vector<struct thread *> thread_table;
\end{ccode}
#+end_export

Thread ID's must be uniqe threfore global static =next_id= variable initialized with 1 (0 belongs to main thread). And incremented every time when a thread created.

=current_thread= is the pointer that points to currently running thread. On switch threads, this pointer is going to point the thread should run next.


** System Calls 

*** Thread Create  

#+begin_export latex
\begin{scode}
    ...
    la $a0, arg0        # args goes to $a0, $a1, $a2
    li $v0, 18          # thread create system call
    la $s0, thread1     # s0: label of the thread
    syscall
    move $1, $v0        # save thread id
    ....
thread1:
    ...
\end{scode}
#+end_export


 This will trigger =new_thread()= function in =syscall.cpp=. This function are going to initialize thread table, only on first call. Then it will set the /program counter/ as the contents of the register =$s0=. In case of the code shown above, program counter is going to be set the address of =thread1= label.

 All other variables which needed to be allocated dynamically (stack etc.) allocated, stack pointers set accordingly, and the thread added to thread table.

 After the thread create system call, register =$v0= is going to gets the value of thread id.
    
*** Thread Join

#+begin_export latex
\begin{scode}
    ...
    li $a0, 1       # a0: thread id
    li $v0, 19      # join the thread with id 1
    syscall
\end{scode}
#+end_export

The state of the currently running thread become blocked, until the thread with specified id become =TERMINATED=. When a thread is terminated with thread exit system call, checks if any thread is waiting for itself. If it is the case changes it state to =READY=.

*** Thread Exit

#+begin_export latex
\begin{scode}
    ...
    li $v0, 20      # thread exit
    syscall
\end{scode}
#+end_export

Exits from the currently running thread, =free='s its resources, unlock its mutexes if there is any. However it doesn't remove from the thread table until the program has finished.


*** Mutex Init 
    
#+begin_export latex
\begin{scode}
.data
mutex1: .space 1
...
    ...
    li $v0, 21         # mutex init system call
    la $a0, mutex1
    syscall
\end{scode}
#+end_export

Initializes the mutex on the given address. A mutex table stored in the =syscall.cpp= which contains the address of the mutex, state of the mutex (either locked or unlocked), owner id and waiting threads.  


#+begin_export latex
\begin{ccode}

static vector<struct mutex> mutex_table;

enum mutex_state { LOCKED, UNLOCKED };

typedef struct mutex {
  reg_word addr;
	mutex_state state;
	int owner_id;
	thread* waiting_threads[64];
}mutex;
\end{ccode}
#+end_export


*** Mutex Lock 
    
#+begin_export latex
\begin{scode}
.data
mutex1: .space 1
...
    ...
    li $v0 22         # mutex lock system call
    la $a0, mutex1    # lock mutex1
    syscall
    ...
\end{scode}
#+end_export


If the mutex can be obtained (if the state of the mutex is unlocked) changes the state of the mutex to locked. =owner_id= set to the id of the thread that locks the mutex.

If a thread makes a mutex lock system call when the mutex is already locked, then the thread added to the =waiting_threads= queue. And the thread will be blocked. To eliminate race condition, /program counter/ will be decremented by 4 so that when the mutex unlocked, any thread can obtain the mutex.
    
*** Mutex Unlock 

#+begin_export latex
\begin{scode}
.data
mutex1: .space 1
...
    ...
    li $v0 23         # mutex unlock system call
    la $a0, mutex1    # unlock mutex1
    syscall
    ...
\end{scode}
#+end_export

Unlocks the mutex, and all other threads waiting on this thread becomes =READY=. 
   

