hw2/report.tex
% Created 2021-06-01 Tue 18:14
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\documentclass{article}
\usepackage{here}
\usepackage{xcolor}
\usepackage[margin=3.0cm]{geometry}
\usepackage{amsmath}
\usepackage{parskip}
\renewcommand\arraystretch{1.4}
\usepackage[margin=1in]{geometry}
\usepackage{minted}
\usepackage{multicol}
\definecolor{bg}{rgb}{0.95,0.95,0.95}
\newminted{c}{fontsize=\footnotesize,frame=single,framesep=2mm}
\newminted{s}{fontsize=\footnotesize,frame=single,framesep=2mm}
\newminted{text}{fontsize=\footnotesize,frame=single,framesep=2mm}
\author{Fatih Kaan Salgır - 171044009}
\date{}
\title{CSE312 - Operating Systems - HW\#2}
\hypersetup{
 pdfauthor={Fatih Kaan Salgır - 171044009},
 pdftitle={CSE312 - Operating Systems - HW\#2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Design Explanation}
\label{sec:orgff1804c}

\begin{itemize}
\item In some cases \texttt{switch\_thread()} needs to be triggered regardless of the timer interrupt. (Like join, mutex lock or thread exit system calls.) In these cases the program counter is incremented 2 times. To avoid this when \texttt{switch\_thread} manually triggered, the program counter decrmeneted by 4 (\texttt{BYTES\_PER\_WORD}).
\end{itemize}

\subsection*{Thread Table}
\label{sec:orgd39dc4d}
Thread tabel are going to keep track of: 
\begin{itemize}
\item Thread ID
\item Program Counter
\item Registers
\item Stack
\item State
\end{itemize}
of each thread.

These data corresponds the struct defined in \texttt{syscall.h} in case of \texttt{spim}:

\begin{ccode}
enum thread_state { READY=0, RUNNING, BLOCKED, TERMINATED };

typedef struct thread {
  int thread_id;
  reg_word R[R_LENGTH];
  reg_word HI, LO;
  mem_addr PC, nPC;
  double *FPR;
  float *FGR;
  int *FWR;
  reg_word CCR[4][32], CPR[4][32];
  mem_word *stack_seg;
  short *stack_seg_h;
  BYTE_TYPE *stack_seg_b;
  mem_addr stack_bot;
  thread_state state;
}thread;
\end{ccode}

\begin{itemize}
\item In spim source code it indicates that \texttt{stack\_seg} represents the stack segment and boundaries. \texttt{stack\_seg\_h} and \texttt{stack\_seg\_b} points to same vector as \texttt{stack\_seg}. This data will be backed \& restored.
\end{itemize}

The process table implemented as global \texttt{std::vector}. The first element of the vector is always going to be the main thread.

\begin{ccode}
static vector<struct thread *> thread_table;
\end{ccode}

Thread ID's must be uniqe threfore global static \texttt{next\_id} variable initialized with 1 (0 belongs to main thread). And incremented every time when a thread created.

\texttt{current\_thread} is the pointer that points to currently running thread. On switch threads, this pointer is going to point the thread should run next.


\subsection*{System Calls}
\label{sec:orgfd24b9e}

\subsubsection*{Thread Create}
\label{sec:org5942e82}

\begin{scode}
    ...
    la $a0, arg0        # args goes to $a0, $a1, $a2
    li $v0, 18          # thread create system call
    la $s0, thread1     # s0: label of the thread
    syscall
    move $1, $v0        # save thread id
    ....
thread1:
    ...
\end{scode}


This will trigger \texttt{new\_thread()} function in \texttt{syscall.cpp}. This function are going to initialize thread table, only on first call. Then it will set the \emph{program counter} as the contents of the register \texttt{\$s0}. In case of the code shown above, program counter is going to be set the address of \texttt{thread1} label.

All other variables which needed to be allocated dynamically (stack etc.) allocated, stack pointers set accordingly, and the thread added to thread table.

After the thread create system call, register \texttt{\$v0} is going to gets the value of thread id.

\subsubsection*{Thread Join}
\label{sec:orgc7018a4}

\begin{scode}
    ...
    li $a0, 1       # a0: thread id
    li $v0, 19      # join the thread with id 1
    syscall
\end{scode}

The state of the currently running thread become blocked, until the thread with specified id become \texttt{TERMINATED}. When a thread is terminated with thread exit system call, checks if any thread is waiting for itself. If it is the case changes it state to \texttt{READY}.

\subsubsection*{Thread Exit}
\label{sec:org4dfe2e0}

\begin{scode}
    ...
    li $v0, 20      # thread exit
    syscall
\end{scode}

Exits from the currently running thread, \texttt{free}'s its resources, unlock its mutexes if there is any. However it doesn't remove from the thread table until the program has finished.


\subsubsection*{Mutex Init}
\label{sec:org3e6a321}

\begin{scode}
.data
mutex1: .space 1
...
    ...
    li $v0, 21         # mutex init system call
    la $a0, mutex1
    syscall
\end{scode}

Initializes the mutex on the given address. A mutex table stored in the \texttt{syscall.cpp} which contains the address of the mutex, state of the mutex (either locked or unlocked), owner id and waiting threads.  


\begin{ccode}

static vector<struct mutex> mutex_table;

enum mutex_state { LOCKED, UNLOCKED };

typedef struct mutex {
  reg_word addr;
	mutex_state state;
	int owner_id;
	thread* waiting_threads[64];
}mutex;
\end{ccode}


\subsubsection*{Mutex Lock}
\label{sec:org577aa32}

\begin{scode}
.data
mutex1: .space 1
...
    ...
    li $v0 22         # mutex lock system call
    la $a0, mutex1    # lock mutex1
    syscall
    ...
\end{scode}


If the mutex can be obtained (if the state of the mutex is unlocked) changes the state of the mutex to locked. \texttt{owner\_id} set to the id of the thread that locks the mutex.

If a thread makes a mutex lock system call when the mutex is already locked, then the thread added to the \texttt{waiting\_threads} queue. And the thread will be blocked. To eliminate race condition, \emph{program counter} will be decremented by 4 so that when the mutex unlocked, any thread can obtain the mutex.

\subsubsection*{Mutex Unlock}
\label{sec:org3aa41e0}

\begin{scode}
.data
mutex1: .space 1
...
    ...
    li $v0 23         # mutex unlock system call
    la $a0, mutex1    # unlock mutex1
    syscall
    ...
\end{scode}

Unlocks the mutex, and all other threads waiting on this thread becomes \texttt{READY}. 
