hw2/report.tex


\section*{Merge Sort}
\label{sec:orgdc8ad0e}
In main label of assembly code threads are created on different parts of array. Threads are responsible of sorting sub-arrays. After waiting for all threads to exit (with join system call), array is merged and printed on the screen.

The code is tested with different number of threads and different array sizes;
\begin{itemize}
\item 2 threads and array size with 16
\item 4 threads and array size with 16
\item 2 threads and array size with 32
\item 4 threads and array size with 32
\end{itemize}

To change the array size or number of threads, parts of the array must be given manually as a parameter before thread create system call.

An example output of running 2 threads with array size 32:

\begin{textcode}
switching: 0->1
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|  4194412|       7fffee7c|       BLOCKED|
|          1|   4000a0|       7fffeffc|       RUNNING|
|          2|   4000a0|       7fffeffc|         READY|
switching: 1->2
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   40006c|       7fffee7c|       BLOCKED|
|          1|   400190|       7fffefbc|         READY|
|          2|   4000a0|       7fffeffc|       RUNNING|
switching: 2->1
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   40006c|       7fffee7c|       BLOCKED|
|          1|   400190|       7fffefbc|       RUNNING|
|          2|   400188|       7fffefcc|         READY|
switching: 1->2
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   40006c|       7fffee7c|         READY|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   400188|       7fffefcc|       RUNNING|
switching: 2->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   40006c|       7fffee7c|       RUNNING|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   400188|       7fffefcc|         READY|
switching: 0->2
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400078|       7fffee7c|       BLOCKED|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   400188|       7fffefcc|       RUNNING|
switching: 2->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|

|          0|   400078|       7fffee7c|       RUNNING|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   4000a8|       7fffeffc|    TERMINATED|
switching: 0->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400078|       7fffee7c|       RUNNING|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   4000a8|       7fffeffc|    TERMINATED|
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 
switching: 0->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400264|       7fffee7c|       RUNNING|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   4000a8|       7fffeffc|    TERMINATED|
18 19 20 21 22 23 24 25 26 27 28 29 30 31 32
\end{textcode}

\newpage


Output of running 4 threads with array size 32:

\begin{textcode}
switching: 0->1
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|  4194468|       7fffee7c|       BLOCKED|
|          1|   400110|       7fffeffc|       RUNNING|
|          2|   400110|       7fffeffc|         READY|
|          3|   400110|       7fffeffc|         READY|
|          4|   400110|       7fffeffc|         READY|
switching: 1->2
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   4000a4|       7fffee7c|         READY|
|          1|   400118|       7fffeffc|    TERMINATED|
|          2|   400110|       7fffeffc|       RUNNING|
|          3|   400110|       7fffeffc|         READY|
|          4|   400110|       7fffeffc|         READY|
switching: 2->3
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   4000a4|       7fffee7c|         READY|
|          1|   400118|       7fffeffc|    TERMINATED|
|          2|   400118|       7fffeffc|    TERMINATED|
|          3|   400110|       7fffeffc|       RUNNING|
|          4|   400110|       7fffeffc|         READY|
switching: 3->4
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   4000a4|       7fffee7c|         READY|
|          1|   400118|       7fffeffc|    TERMINATED|
|          2|   400118|       7fffeffc|    TERMINATED|
|          3|   400264|       7fffefcc|         READY|
|          4|   400110|       7fffeffc|       RUNNING|
switching: 4->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   4000a4|       7fffee7c|       RUNNING|
|          1|   400118|       7fffeffc|    TERMINATED|
|          2|   400118|       7fffeffc|    TERMINATED|
|          3|   400264|       7fffefcc|         READY|
|          4|   400118|       7fffeffc|    TERMINATED|
switching: 0->3
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   4000bc|       7fffee7c|       BLOCKED|
|          1|   400118|       7fffeffc|    TERMINATED|
|          2|   400118|       7fffeffc|    TERMINATED|
|          3|   400264|       7fffefcc|       RUNNING|
|          4|   400118|       7fffeffc|    TERMINATED|
switching: 3->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   4000bc|       7fffee7c|       RUNNING|
|          1|   400118|       7fffeffc|    TERMINATED|
|          2|   400118|       7fffeffc|    TERMINATED|
|          3|   400118|       7fffeffc|    TERMINATED|
|          4|   400118|       7fffeffc|    TERMINATED|
switching: 0->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400248|       7fffee7c|       RUNNING|
|          1|   400118|       7fffeffc|    TERMINATED|
|          2|   400118|       7fffeffc|    TERMINATED|
|          3|   400118|       7fffeffc|    TERMINATED|
|          4|   400118|       7fffeffc|    TERMINATED|
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32
\end{textcode}


\newpage


Output of running 2 threads with array size 16:

\begin{textcode}
switching: 0->1
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|  4194412|       7fffee9c|       BLOCKED|
|          1|   4000a0|       7fffeffc|       RUNNING|
|          2|   4000a0|       7fffeffc|         READY|
switching: 1->2
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   40006c|       7fffee9c|         READY|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   4000a0|       7fffeffc|       RUNNING|
switching: 2->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   40006c|       7fffee9c|       RUNNING|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   400114|       7fffefec|         READY|
switching: 0->2
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400078|       7fffee9c|       BLOCKED|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   400114|       7fffefec|       RUNNING|
switching: 2->0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400078|       7fffee9c|       RUNNING|
|          1|   4000a8|       7fffeffc|    TERMINATED|
|          2|   4000a8|       7fffeffc|    TERMINATED|
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16
\end{textcode}
