hw2/report.tex

\section*{Producer \& Consumer}
\label{sec:orga15987b}

The shared variable will be a \texttt{word} which its value starts with 0. Producer will increment it 1000 times and consumer will decrement it 1000 times. Queue size will be 50, the producer will wait when the queue is full, similarly the consumer will wait when the queue is empty. Waiting is implemented as busy waiting in assembly code.


\begin{multicols}{2}
\begin{minted}[fontsize=\footnotesize,frame=single,framesep=2mm,highlightlines={4,5,8}]{s}
producer:
    li $s1, 0
produce_loop:
    jal wait_empty
    jal mutex_lock
    jal produce    # critical section
    jal print_newline
    jal mutex_unlock
    addi $s1, $s1, 1
    blt $s1, 1000, produce_loop
    li $v0, 20      # thread exit
    syscall
\end{minted}
\begin{minted}[fontsize=\footnotesize,frame=single,framesep=2mm,highlightlines={4,5,8}]{s}
consumer:
    li $s1, 0
consume_loop:
    jal wait_full
    jal mutex_lock
    jal consume    # critical section
    jal print_newline
    jal mutex_unlock
    addi $s1, $s1, 1
    blt $s1, 1000, consume_loop
    li $v0, 20      # thread exit
    syscall
\end{minted}
\end{multicols}


The only difference between two version is waiting and mutex calls are commented in the first case (Highlighted in the code above).

\newpage

\subsection*{Race conditions without mutexes}
\label{sec:org4364e57}

Because of the race condition, the shared variable reperesents the size of the queue, most probably ends up a value different than 0.

 \begin{minted}[fontsize=\footnotesize,frame=single,framesep=2mm,highlightlines=4]{text}
...(truncated)
consumer -236
consumer -237
consumer -238
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400064|       7fffee7c|       RUNNING|
|          1|   400104|       7fffeffc|    TERMINATED|
|          2|   400138|       7fffeffc|    TERMINATED|
total produced: 1000
total consumed: 1000
\end{minted}


\subsection*{No race conditions with mutexes}
\label{sec:org255bcba}

The program ends with consumer thread consuming the last element which is 0.

\begin{minted}[fontsize=\footnotesize,frame=single,framesep=2mm,highlightlines=12]{text}
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|  4194404|       7fffee7c|       BLOCKED|
|          1|   4000d4|       7fffeffc|       RUNNING|
|          2|   400114|       7fffeffc|         READY|
producer 1
producer 2
producer 3
...(truncated)
consumer 2
consumer 1
consumer 0
| thread id |      PC | stack pointer | thread state |
|-----------|---------|---------------|--------------|
|          0|   400064|       7fffee7c|       RUNNING|
|          1|   400110|       7fffeffc|    TERMINATED|
|          2|   400150|       7fffeffc|    TERMINATED|
total produced: 1000
total consumed: 1000
\end{minted}


 In the first case, \texttt{size} is the shared variable but it is not protected, therefore it does not end up with 0. In the second case it does.
Total produced and total consumed didn't change, because threads are using the different variables, not shared variables.
\end{document}